<?xml version="1.0"?>
<net name="vehicle-attributes-recognition-barrier-0039" version="6" batch="1">
	<layers>
		<layer name="input" type="Input" precision="FP32" id="0">
			<output>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>72</dim>
					<dim>72</dim>
				</port>
			</output>
		</layer>
		<layer name="Mul_/Fused_Mul_/FusedScaleShift_" type="ScaleShift" precision="FP32" id="1">
			<data broadcast="0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>72</dim>
					<dim>72</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>72</dim>
					<dim>72</dim>
				</port>
			</output>
			<blobs>
				<biases offset="0" size="12" />
				<weights offset="12" size="12" />
			</blobs>
		</layer>
		<layer name="Convolution1" type="Convolution" precision="FP32" id="2">
			<data dilations="1,1" group="1" kernel="7,7" output="64" pads_begin="3,3" pads_end="3,3" quantization_level="FP32" strides="2,2" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>72</dim>
					<dim>72</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>36</dim>
					<dim>36</dim>
				</port>
			</output>
			<blobs>
				<biases offset="24" size="256" />
				<weights offset="280" size="37632" />
			</blobs>
		</layer>
		<layer name="ReLU1" type="ReLU" precision="FP32" id="3">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>36</dim>
					<dim>36</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>36</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer name="Pooling1" type="Pooling" precision="FP32" id="4">
			<data exclude-pad="true" kernel="3,3" pads_begin="0,0" pads_end="0,0" pool-method="max" rounding_type="ceil" strides="2,2" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>36</dim>
					<dim>36</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</output>
		</layer>
		<layer name="Convolution2" type="Convolution" precision="FP32" id="5">
			<data dilations="1,1" group="1" kernel="3,3" output="64" pads_begin="1,1" pads_end="1,1" quantization_level="FP32" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</output>
			<blobs>
				<biases offset="37912" size="256" />
				<weights offset="38168" size="147456" />
			</blobs>
		</layer>
		<layer name="ReLU2" type="ReLU" precision="FP32" id="6">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</output>
		</layer>
		<layer name="Convolution3" type="Convolution" precision="FP32" id="7">
			<data dilations="1,1" group="1" kernel="3,3" output="64" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</output>
			<blobs>
				<weights offset="185624" size="147456" />
			</blobs>
		</layer>
		<layer name="Eltwise1" type="Eltwise" precision="FP32" id="8">
			<data operation="sum" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</output>
		</layer>
		<layer name="Mul_941/Fused_Mul_/FusedScaleShift_" type="ScaleShift" precision="FP32" id="9">
			<data broadcast="0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</output>
			<blobs>
				<biases offset="333080" size="256" />
				<weights offset="333336" size="256" />
			</blobs>
		</layer>
		<layer name="ReLU3" type="ReLU" precision="FP32" id="10">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</output>
		</layer>
		<layer name="Convolution6" type="Convolution" precision="FP32" id="11">
			<data dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="2,2" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>9</dim>
				</port>
			</output>
			<blobs>
				<weights offset="333592" size="32768" />
			</blobs>
		</layer>
		<layer name="Convolution4" type="Convolution" precision="FP32" id="12">
			<data dilations="1,1" group="1" kernel="3,3" output="128" pads_begin="1,1" pads_end="1,1" quantization_level="FP32" strides="2,2" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>9</dim>
				</port>
			</output>
			<blobs>
				<biases offset="366360" size="512" />
				<weights offset="366872" size="294912" />
			</blobs>
		</layer>
		<layer name="ReLU4" type="ReLU" precision="FP32" id="13">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>9</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>9</dim>
				</port>
			</output>
		</layer>
		<layer name="Convolution5" type="Convolution" precision="FP32" id="14">
			<data dilations="1,1" group="1" kernel="3,3" output="128" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>9</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>9</dim>
				</port>
			</output>
			<blobs>
				<weights offset="661784" size="589824" />
			</blobs>
		</layer>
		<layer name="Eltwise2" type="Eltwise" precision="FP32" id="15">
			<data operation="sum" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>9</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>9</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>9</dim>
				</port>
			</output>
		</layer>
		<layer name="Mul_938/Fused_Mul_/FusedScaleShift_" type="ScaleShift" precision="FP32" id="16">
			<data broadcast="0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>9</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>9</dim>
				</port>
			</output>
			<blobs>
				<biases offset="1251608" size="512" />
				<weights offset="1252120" size="512" />
			</blobs>
		</layer>
		<layer name="ReLU5" type="ReLU" precision="FP32" id="17">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>9</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>9</dim>
				</port>
			</output>
		</layer>
		<layer name="Convolution9_" type="Convolution" precision="FP32" id="18">
			<data dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="2,2" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>9</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1252632" size="65536" />
			</blobs>
		</layer>
		<layer name="Convolution7_" type="Convolution" precision="FP32" id="19">
			<data dilations="1,1" group="1" kernel="3,3" output="128" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="2,2" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>9</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
			<blobs>
				<biases offset="1318168" size="512" />
				<weights offset="1318680" size="589824" />
			</blobs>
		</layer>
		<layer name="ReLU6_" type="ReLU" precision="FP32" id="20">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer name="Convolution8_" type="Convolution" precision="FP32" id="21">
			<data dilations="1,1" group="1" kernel="3,3" output="128" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1908504" size="589824" />
			</blobs>
		</layer>
		<layer name="Eltwise3" type="Eltwise" precision="FP32" id="22">
			<data operation="sum" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>128</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer name="conv_type" type="Convolution" precision="FP32" id="23">
			<data dilations="1,1" group="1" kernel="1,1" output="4" pads_begin="0,0" pads_end="0,0" quantization_level="FP32" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>4</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
			<blobs>
				<biases offset="2498328" size="16" />
				<weights offset="2498344" size="2048" />
			</blobs>
		</layer>
		<layer name="relu_conv_type" type="ReLU" precision="FP32" id="24">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>4</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer name="pool_type" type="Pooling" precision="FP32" id="25">
			<data exclude-pad="false" kernel="5,5" pads_begin="0,0" pads_end="0,0" pool-method="avg" rounding_type="ceil" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer name="type" type="SoftMax" precision="FP32" id="26">
			<data axis="1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer name="conv_color" type="Convolution" precision="FP32" id="27">
			<data dilations="1,1" group="1" kernel="1,1" output="7" pads_begin="0,0" pads_end="0,0" quantization_level="FP32" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>7</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
			<blobs>
				<biases offset="2500392" size="28" />
				<weights offset="2500420" size="3584" />
			</blobs>
		</layer>
		<layer name="relu_conv_color" type="ReLU" precision="FP32" id="28">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>7</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>7</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer name="pool_color" type="Pooling" precision="FP32" id="29">
			<data exclude-pad="false" kernel="5,5" pads_begin="0,0" pads_end="0,0" pool-method="avg" rounding_type="ceil" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>7</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>7</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer name="color" type="SoftMax" precision="FP32" id="30">
			<data axis="1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>7</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>7</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="1" to-port="0" />
		<edge from-layer="1" from-port="1" to-layer="2" to-port="0" />
		<edge from-layer="2" from-port="1" to-layer="3" to-port="0" />
		<edge from-layer="3" from-port="1" to-layer="4" to-port="0" />
		<edge from-layer="4" from-port="1" to-layer="5" to-port="0" />
		<edge from-layer="4" from-port="1" to-layer="8" to-port="1" />
		<edge from-layer="5" from-port="1" to-layer="6" to-port="0" />
		<edge from-layer="6" from-port="1" to-layer="7" to-port="0" />
		<edge from-layer="7" from-port="1" to-layer="8" to-port="0" />
		<edge from-layer="8" from-port="2" to-layer="9" to-port="0" />
		<edge from-layer="9" from-port="1" to-layer="10" to-port="0" />
		<edge from-layer="10" from-port="1" to-layer="12" to-port="0" />
		<edge from-layer="10" from-port="1" to-layer="11" to-port="0" />
		<edge from-layer="11" from-port="1" to-layer="15" to-port="1" />
		<edge from-layer="12" from-port="1" to-layer="13" to-port="0" />
		<edge from-layer="13" from-port="1" to-layer="14" to-port="0" />
		<edge from-layer="14" from-port="1" to-layer="15" to-port="0" />
		<edge from-layer="15" from-port="2" to-layer="16" to-port="0" />
		<edge from-layer="16" from-port="1" to-layer="17" to-port="0" />
		<edge from-layer="17" from-port="1" to-layer="19" to-port="0" />
		<edge from-layer="17" from-port="1" to-layer="18" to-port="0" />
		<edge from-layer="18" from-port="1" to-layer="22" to-port="1" />
		<edge from-layer="19" from-port="1" to-layer="20" to-port="0" />
		<edge from-layer="20" from-port="1" to-layer="21" to-port="0" />
		<edge from-layer="21" from-port="1" to-layer="22" to-port="0" />
		<edge from-layer="22" from-port="2" to-layer="27" to-port="0" />
		<edge from-layer="22" from-port="2" to-layer="23" to-port="0" />
		<edge from-layer="23" from-port="1" to-layer="24" to-port="0" />
		<edge from-layer="24" from-port="1" to-layer="25" to-port="0" />
		<edge from-layer="25" from-port="1" to-layer="26" to-port="0" />
		<edge from-layer="27" from-port="1" to-layer="28" to-port="0" />
		<edge from-layer="28" from-port="1" to-layer="29" to-port="0" />
		<edge from-layer="29" from-port="1" to-layer="30" to-port="0" />
	</edges>
	<statistics>
		<layer>
			<name>Convolution1</name>
			<min>-0.000005, -0.468171, -0.558317, -0.585554, -0.007512, -1.013561, -0.416088, -0.599785, -0.232968, -0.000033, -1.095625, -0.000000, -0.000012, -0.017073, -0.862631, -0.000010, -0.542955, -0.529014, -0.624248, -0.833468, -0.859177, -1.056603, -0.562168, -0.815792, -0.000373, -0.370141, -1.321340, -0.000039, -0.067131, -0.771320, -1.366814, -0.326049, -0.908061, -0.000363, -0.561713, -0.216276, -0.637627, -0.587495, -0.000000, -0.272132, -0.596152, -0.720286, -0.510997, -0.861147, -0.497307, -0.988673, -0.432323, -0.383492, -1.143091, -0.749996, -0.448895, -0.000000, -0.000000, -0.632388, -0.770533, -0.324277, -0.673190, -0.000000, -0.578882, -0.311767, -0.238961, -0.169257, -0.727515, -1.374047</min>
			<max>-0.000002, 0.497820, 0.832506, 0.346552, -0.000189, 0.203427, 0.714980, 0.501595, 0.467396, -0.000026, 1.200957, -0.000000, -0.000006, -0.002029, 0.898271, -0.000005, 0.766077, 0.533865, 0.872860, 0.826616, 0.752538, 1.163071, 0.659017, 0.915900, -0.000156, 0.508371, 0.465510, -0.000006, 0.415144, 0.486053, 0.630878, 0.672043, 0.693676, -0.000055, 0.765972, 0.267683, 0.656781, 0.560202, -0.000000, 0.572641, 0.644302, 0.777188, 0.545727, 0.547142, 0.516240, 1.077425, 0.504107, 0.453935, 0.264638, 0.502588, 0.426357, -0.000000, -0.000000, 0.738134, 0.467730, 0.445617, 0.793476, -0.000000, 0.659369, 0.358823, 0.305420, 0.878953, 0.503664, 0.529017</max>
		</layer>
		<layer>
			<name>Convolution2</name>
			<min>-1.098502, -1.652673, -1.292799, -0.695292, -0.771664, -0.704992, -1.173826, -1.254422, -0.853285, -1.627373, -3.257172, -2.543629, -2.684237, -3.094170, -3.640336, -1.167094, -2.777050, -1.166496, -1.218535, -2.481499, -0.461570, -1.602698, -0.952713, -2.757544, -3.438644, -1.187139, -1.791467, -2.665778, -3.466931, -1.336845, -1.921759, -0.806761, -0.710611, -3.418076, -1.694722, -1.274505, -2.132475, -2.448902, -2.044989, -1.861555, -3.604242, -1.408006, -2.197599, -2.168938, -1.872699, -0.531415, -2.961770, -3.565571, -0.596931, -1.640053, -1.817287, -1.284543, -1.882612, -1.407553, -1.422778, -2.005674, -2.631362, -2.576587, -2.504231, -1.498285, -1.126524, -0.709283, -3.886657, -1.442050</min>
			<max>1.149957, 1.799291, 1.168950, 0.523522, 1.063294, 1.542535, 1.123924, 0.657397, 0.895590, 0.998299, 1.200789, 1.382979, 1.868789, 1.241208, 1.036975, 1.490843, 1.424365, 0.645173, 1.358467, 1.134480, 0.711281, 1.521438, 1.241640, 1.085441, 0.800033, 1.426338, 1.078513, 1.577697, 1.401667, 1.336875, 1.395761, 1.016825, 0.990026, 0.970445, 0.767162, 1.027512, 1.287511, 1.436469, 1.009385, 1.295796, 1.123551, 1.040126, 1.322944, 1.631079, 1.473608, 1.312555, 0.995855, 0.958212, 0.210745, 1.826255, 1.314905, 1.115719, 1.441668, 0.800977, 1.166564, 1.930096, 1.393550, 1.436534, 1.496468, 1.576848, 1.158102, 0.676285, 1.170441, 0.785163</max>
		</layer>
		<layer>
			<name>Convolution3</name>
			<min>-0.017028, -1.487755, -1.673704, -1.655671, -1.524418, -1.203917, -0.703411, -1.504434, -1.494970, -1.276353, -2.029468, -1.685464, -1.072019, -1.407206, -2.019669, -1.762276, -1.983794, -1.267916, -2.427867, -1.692326, -1.258807, -2.007200, -1.597326, -1.716579, -1.542513, -1.846280, -0.995210, -1.470429, -0.737458, -1.539257, -1.350720, -1.060818, -1.766542, -0.878640, -1.315096, -0.960051, -2.159239, -1.105813, -1.222792, -1.168237, -1.471085, -1.496082, -1.521773, -0.357035, -1.904147, -1.841341, -1.003195, -1.105668, -1.165461, -1.330070, -1.094196, -1.276935, -1.054696, -1.498539, -1.753322, -1.198443, -1.223009, -1.247669, -2.315083, -0.706449, -0.739838, -0.683405, -2.504110, -0.846214</min>
			<max>1.774242, 0.554845, 0.604507, 0.564758, 0.281967, 0.767644, 0.878304, 0.138305, 0.764049, 0.954617, 0.727941, 1.227051, 0.536636, 1.091346, 0.412984, 0.672788, 0.622063, 0.322679, 0.998433, 0.701887, 0.981225, 0.148793, 0.600544, 0.317761, 0.785881, 0.448717, 0.607089, 1.082354, 0.605373, 0.484771, 0.443209, 1.097619, 0.717130, 1.137769, 0.273552, 0.408541, 0.710548, 0.785086, 0.641267, 0.596856, 0.782577, 0.629360, 1.073299, 1.059476, 0.602181, 0.435138, 0.667813, 0.469326, 1.021919, 0.567641, 0.479659, 0.645271, 0.974916, 0.137630, 0.693514, 0.566281, 0.920627, 0.461210, 0.906541, 0.563406, 0.595676, 0.557083, 0.844296, 0.629574</max>
		</layer>
		<layer>
			<name>Convolution4</name>
			<min>-1.163678, -0.988461, -0.878521, -0.960230, -1.013843, -1.095626, -0.850668, -0.973326, -1.216645, -1.027506, -0.576591, -1.088623, -1.447615, -1.055645, -1.049181, -1.069357, -1.191690, -0.987179, -0.893215, -0.791418, -1.027495, -1.046975, -1.067589, -1.022343, -0.585755, -1.020022, -0.856144, -1.022344, -1.325944, -1.053216, -0.854086, -1.106521, -1.180389, -1.130143, -1.068603, -1.377978, -1.171535, -1.157455, -1.105008, -1.244415, -1.103494, -0.927235, -0.590122, -1.051891, -1.067084, -0.836372, -1.089619, -1.036393, -1.269433, -0.923484, -1.022650, -0.973861, -1.109921, -1.262019, -1.242923, -1.050880, -0.876912, -1.256205, -1.126109, -1.088141, -1.018697, -1.339949, -0.935818, -1.052249, -0.866647, -1.229956, -1.061465, -0.902857, -1.409805, -1.562131, -0.948189, -0.870440, -1.479956, -1.119729, -1.010025, -1.240378, -1.115050, -1.059754, -1.278100, -1.088905, -1.032416, -1.376128, -0.602091, -0.949607, -1.066123, -1.526357, -0.123372, -1.149673, -1.092868, -1.129006, -0.963926, -1.255021, -1.188450, -1.434923, -1.246647, -1.094667, -0.997965, -0.891948, -0.988816, -0.887082, -1.202354, -0.834385, -0.895983, -1.207621, -0.980702, -1.183622, -1.062238, -1.058265, -1.086310, -1.225348, -1.053063, -1.064059, -1.099063, -1.008461, -1.034848, -1.260657, -0.748438, -1.571788, -1.218363, -1.192959, -1.269116, -0.890249, -1.024153, -1.157374, -1.372261, -1.045582, -1.236042, -0.910938</min>
			<max>0.730971, 0.871024, 0.847801, 0.659128, 0.819444, 0.660748, 0.643506, 0.667783, 0.931378, 0.659541, 0.648733, 0.867783, 0.843434, 0.702816, 0.703523, 0.527665, 0.707799, 0.759652, 0.634136, 0.721965, 0.650413, 0.600414, 0.794543, 0.736906, 0.472175, 0.642349, 0.475547, 0.667468, 0.578054, 0.683662, 0.725845, 0.640342, 0.666344, 0.954672, 0.936463, 0.968798, 0.931694, 0.789229, 0.784703, 0.698049, 0.764269, 0.574454, 0.569822, 0.918085, 0.649320, 0.475810, 0.629136, 0.645257, 0.997615, 1.041137, 0.992302, 0.820052, 0.572717, 0.941744, 0.729752, 0.858700, 0.481110, 1.074935, 0.696718, 0.673904, 0.738104, 0.700115, 0.869723, 0.657767, 0.557694, 0.774682, 0.847884, 0.699341, 0.746636, 0.713455, 0.587029, 0.531899, 0.839265, 0.664002, 0.581665, 0.734524, 0.754002, 0.631387, 0.782777, 0.795419, 0.597503, 0.654458, 0.576333, 0.468061, 0.639559, 0.681668, 0.145221, 0.999873, 0.673812, 0.614949, 0.609713, 0.910629, 0.724051, 0.686831, 0.669095, 0.667599, 0.631204, 0.732421, 0.700751, 0.429144, 0.881050, 0.451574, 0.619027, 0.905507, 0.572302, 0.754130, 0.667575, 0.728752, 0.809867, 0.746696, 0.686627, 0.892574, 0.529282, 0.425024, 0.554133, 0.722652, 0.737739, 0.784869, 0.787256, 0.698479, 0.580135, 0.485946, 0.692269, 0.716703, 0.665321, 0.675131, 0.777950, 0.389443</max>
		</layer>
		<layer>
			<name>Convolution5</name>
			<min>-0.439761, -0.563615, -0.595067, -0.468977, -0.471060, -0.566677, -0.497854, -0.394944, -0.519025, -0.423309, -0.494160, -0.422519, -0.418033, -0.370335, -0.620912, -0.507665, -0.585451, -0.463025, -0.332019, -0.408215, -0.503401, -0.405785, -0.356937, -0.274942, -0.610285, -0.592163, -0.480395, -0.568840, -0.342714, -0.363488, -0.442843, -0.321784, -0.448547, -0.407210, -0.352030, -0.310995, -0.486805, -0.437887, -0.456474, -0.471811, -0.654817, -0.411785, -0.445923, -0.630226, -0.468735, -0.608612, -0.447653, -0.397887, -0.471624, -0.386688, -0.526358, -0.389370, -0.394507, -0.449907, -0.412947, -0.389285, -0.456108, -0.535485, -0.523970, -0.466155, -0.384311, -0.477213, -0.394876, -0.464526, -0.580205, -0.456914, -0.419795, -0.397807, -0.433372, -0.370319, -0.455501, -0.392595, -0.435555, -0.506634, -0.521296, -0.680159, -0.461938, -0.477689, -0.452639, -0.401417, -0.443373, -0.414191, -0.323949, -0.496836, -0.472260, -0.459692, -0.411238, -0.499101, -0.474719, -0.484166, -0.418564, -0.455608, -0.498723, -0.576475, -0.616918, -0.427991, -0.316929, -0.451494, -0.458911, -0.441579, -0.534112, -0.575197, -0.351557, -0.475050, -0.492516, -0.622784, -0.437984, -0.440345, -0.558046, -0.389604, -0.456166, -0.389740, -0.441956, -0.446035, -0.514954, -0.151255, -0.517488, -0.311711, -0.305469, -0.409209, -0.422983, -0.353067, -0.443805, -0.641238, -0.453691, -0.400075, -0.598118, -0.403178</min>
			<max>0.200856, 0.221410, 0.263018, 0.147891, 0.183042, 0.554279, 0.231096, 0.367310, 0.218640, 0.418890, 0.249892, 0.479055, 0.171260, 0.227639, 0.235426, 0.333333, 0.245548, 0.554974, 0.327125, 0.296519, 0.273345, 0.321082, 0.242694, 0.274486, 0.101133, 0.221745, 0.322810, 0.118420, 0.283426, 0.287556, 0.226070, 0.232536, 0.363482, 0.197913, 0.485893, 0.224047, 0.380445, 0.246375, 0.256387, 0.215602, 0.086823, 0.248473, 0.151244, 0.277584, 0.219664, 0.347100, 0.195772, 0.433420, 0.185288, 0.261143, 0.274081, 0.311593, 0.350109, 0.205241, 0.249934, 0.307223, 0.312147, 0.174891, 0.188533, 0.135045, 0.331899, 0.200836, 0.252846, 0.268004, 0.244516, 0.273791, 0.247370, 0.235458, 0.195359, 0.156559, 0.257846, 0.236382, 0.216910, 0.214244, 0.183899, 0.130513, 0.230812, 0.197156, 0.177835, 0.171626, 0.205292, 0.270667, 0.435642, 0.234463, 0.237115, 0.260316, 0.285942, 0.310525, 0.257137, 0.300631, 0.289125, 0.208787, 0.254494, 0.096603, 0.270467, 0.261460, 0.323681, 0.195777, 0.198999, 0.326082, 0.250530, 0.176400, 0.226271, 0.169688, 0.223830, 0.092745, 0.205652, 0.223771, 0.289484, 0.282144, 0.193421, 0.230882, 0.140434, 0.373008, 0.221023, 0.367763, 0.315092, 0.351097, 0.477192, 0.410058, 0.245878, 0.377333, 0.273307, 0.286632, 0.393346, 0.293250, 0.159241, 0.260430</max>
		</layer>
		<layer>
			<name>Convolution6</name>
			<min>-0.089482, -0.095289, -0.137826, -0.082785, -0.118646, -0.087762, -0.088236, -0.120866, -0.129330, -0.115775, -0.103110, -0.062163, -0.079410, -0.088940, -0.167914, -0.057917, -0.088635, -0.058831, -0.053083, -0.077133, -0.117731, -0.104811, -0.084660, -0.227422, -0.212300, -0.066927, -0.061501, -0.099632, -0.192017, -0.080907, -0.122938, -0.101491, -0.123015, -0.045389, -0.086528, -0.040804, -0.101535, -0.101838, -0.051891, -0.159844, -0.069340, -0.062727, -0.067563, -0.084584, -0.120350, -0.119272, -0.078163, -0.097650, -0.091893, -0.055983, -0.194983, -0.098828, -0.073183, -0.139064, -0.058506, -0.108071, -0.087544, -0.068032, -0.093350, -0.092769, -0.048312, -0.095119, -0.084137, -0.081320, -0.228878, -0.060920, -0.149742, -0.072877, -0.073828, -0.085126, -0.068067, -0.083705, -0.078533, -0.083134, -0.057239, -0.067750, -0.076270, -0.066851, -0.053960, -0.118079, -0.061820, -0.062638, -0.046306, -0.072079, -0.107817, -0.097724, -0.097555, -0.111627, -0.067221, -0.041476, -0.071379, -0.050021, -0.086146, -0.120597, -0.167625, -0.079938, -0.106877, -0.128042, -0.053231, -0.108939, -0.047269, -0.098221, -0.054004, -0.051497, -0.110267, -0.093833, -0.148626, -0.116559, -0.072274, -0.114716, -0.153868, -0.050409, -0.070366, -0.077674, -0.164571, -0.162034, -0.155111, -0.048567, -0.079536, -0.093881, -0.083785, -0.058592, -0.123918, -0.136604, -0.049754, -0.157326, -0.212170, -0.078485</min>
			<max>0.074599, 0.070884, 0.060195, 0.042119, 0.028859, 0.077403, 0.038547, 0.074949, 0.032293, 0.049927, 0.049978, 0.054383, 0.038449, 0.029097, 0.028898, 0.099965, 0.058001, 0.044163, 0.075166, 0.053025, 0.073868, 0.048787, 0.045243, 0.121419, 0.096524, 0.059339, 0.042569, 0.057380, 0.127808, 0.047031, 0.059215, 0.045075, 0.027293, 0.045424, 0.087070, 0.112739, 0.042819, 0.127568, 0.055047, 0.177498, 0.075438, 0.083345, 0.031440, 0.030249, 0.061329, 0.053656, 0.069371, 0.064197, 0.075532, 0.093839, 0.059917, 0.071789, 0.038073, 0.105234, 0.084930, 0.039033, 0.041521, 0.038836, 0.081817, 0.050374, 0.065868, 0.060850, 0.134864, 0.048442, 0.118099, 0.036293, 0.032170, 0.051263, 0.041693, 0.050679, 0.030128, 0.052085, 0.064390, 0.050644, 0.064175, 0.055633, 0.037737, 0.040208, 0.079542, 0.054652, 0.041334, 0.042469, 0.058818, 0.057390, 0.067963, 0.047420, 0.064472, 0.082044, 0.052592, 0.051642, 0.047827, 0.091729, 0.023830, 0.055574, 0.046957, 0.034968, 0.079328, 0.071675, 0.142725, 0.037768, 0.045237, 0.214830, 0.056219, 0.064242, 0.206308, 0.023412, 0.053059, 0.106104, 0.109903, 0.036629, 0.033530, 0.056776, 0.083207, 0.081408, 0.034262, 0.083720, 0.029517, 0.119666, 0.077622, 0.090700, 0.101907, 0.084785, 0.106063, 0.098886, 0.067882, 0.062060, 0.017478, 0.096507</max>
		</layer>
		<layer>
			<name>Convolution7_</name>
			<min>-2.215609, -1.912781, -2.451430, -1.582963, -1.515460, -2.113768, -2.226237, -1.848880, -1.886669, -1.274036, -1.890919, -4.721658, -1.826431, -1.521296, -2.025265, -3.201293, -1.793901, -1.524532, -2.334015, -1.841306, -2.762923, -1.808418, -1.264114, -2.557080, -1.749650, -1.425438, -2.032513, -1.895699, -2.032521, -1.509109, -2.752192, -1.750388, -3.678217, -2.336217, -1.537560, -2.485640, -3.341643, -2.358865, -2.322185, -2.015939, -2.172734, -1.942976, -2.525274, -1.794242, -1.576328, -2.379991, -1.883147, -1.783739, -1.722680, -1.934142, -2.541844, -2.123822, -3.025217, -1.852017, -3.790054, -1.961537, -1.671417, -1.975165, -2.093167, -1.476847, -1.290135, -3.290838, -4.737681, -1.939017, -3.881720, -2.066238, -1.715949, -1.309314, -1.333133, -1.528140, -1.729257, -2.501204, -1.795763, -1.506547, -1.846480, -2.134313, -2.124719, -1.829100, -2.617516, -1.883698, -1.974440, -1.867660, -1.784665, -2.544510, -1.761370, -1.851449, -2.125002, -2.296850, -1.715088, -2.717076, -3.000052, -1.948582, -1.350606, -1.905949, -2.287585, -2.077981, -1.357321, -1.441318, -2.872938, -1.458346, -2.517584, -1.898482, -2.377775, -1.425892, -2.426566, -1.909781, -2.028990, -1.844113, -1.964305, -1.903566, -2.207472, -2.101010, -1.619392, -1.369358, -2.284668, -2.095020, -2.198459, -1.824583, -1.793834, -2.144227, -2.433780, -1.724818, -1.410595, -1.998477, -1.774688, -2.849646, -2.509239, -1.520611</min>
			<max>2.219637, 3.100589, 2.187948, 2.102848, 3.639997, 2.638006, 1.934749, 1.903428, 2.239963, 3.908577, 2.235557, 2.757043, 2.092916, 2.955276, 2.558744, 2.309228, 2.075054, 2.564772, 3.022814, 2.204055, 2.862220, 2.318145, 1.891746, 2.473439, 1.957746, 2.694272, 3.782289, 2.615289, 9.435650, 1.856210, 3.453146, 3.004709, 1.840837, 2.171967, 5.553186, 2.259798, 2.905384, 3.471883, 2.353508, 2.719613, 2.104886, 2.050409, 2.418790, 2.119813, 2.340060, 3.732153, 3.199126, 2.957704, 1.927270, 1.838898, 2.400283, 2.285613, 2.628476, 2.113009, 2.989508, 2.709946, 2.960316, 2.619833, 5.116774, 2.114981, 2.500221, 2.719128, 2.706924, 2.467298, 2.543561, 1.863301, 3.057125, 2.593158, 3.723311, 2.045046, 1.975818, 2.061540, 2.141597, 2.628402, 2.577204, 4.250273, 2.638589, 2.393846, 1.913180, 2.566841, 5.853989, 2.127892, 3.302089, 2.492812, 2.178815, 3.195024, 5.283424, 3.714353, 2.563003, 2.509213, 2.085130, 2.761163, 1.411935, 2.915468, 1.803977, 3.676708, 3.703302, 3.257535, 2.703842, 3.896432, 1.904963, 2.208297, 7.098861, 3.254768, 2.380996, 15.311474, 2.521549, 2.651836, 1.974031, 2.904106, 3.142952, 2.510575, 2.167778, 1.773637, 2.047803, 3.162931, 2.223680, 2.681034, 15.820799, 1.540074, 2.771089, 2.315362, 2.224250, 2.310153, 3.788263, 2.181431, 2.756085, 2.397641</max>
		</layer>
		<layer>
			<name>Convolution8_</name>
			<min>-1.872459, -5.352844, -2.649566, -2.087601, -3.926633, -2.926332, -4.724067, -3.956396, -2.163938, -2.171557, -1.815497, -3.727360, -5.837323, -8.681602, -1.875955, -0.274282, -3.129096, -5.792335, -1.047669, -2.274732, -3.495958, -7.472712, -2.138810, -5.228797, -7.629498, -6.281832, -1.957520, -2.338044, -4.366765, -1.117212, -3.135387, -10.761464, -3.302176, -3.646890, -2.636179, -2.567659, -2.177609, -3.011981, -4.514054, -4.048757, -1.548823, -5.782872, -1.647608, -4.231062, -7.039589, -2.523952, -3.323762, -2.400477, -2.893712, -1.915588, -1.043866, -2.484202, -2.822738, -3.732413, -3.211005, -2.276246, -5.610425, -4.879899, -4.587411, -1.157857, -5.089610, -5.863313, -1.397808, -1.735279, -1.073073, -2.454280, -4.051306, -1.784232, -2.183633, -1.469260, -3.743354, -4.941779, -4.690630, -4.118478, -4.523169, -3.554013, -1.118680, -5.615449, -2.736537, -3.768539, -7.642808, -3.207220, -4.681343, -6.024813, -1.525043, -3.754062, -2.566616, -3.590148, -0.694618, -3.771402, -3.839064, -0.058365, -2.007512, -4.460944, -0.611200, -2.451908, -2.858715, -1.560654, -5.710912, -2.256960, -4.385028, -6.050653, -3.611690, 0.499684, -3.778012, -6.750606, -3.572942, -2.770468, -3.070397, -1.009839, -1.558368, -4.802804, -2.048741, -0.405085, -4.601075, -4.514427, -6.188592, -9.915135, -6.424173, -8.371862, -4.011086, -2.993605, -6.663713, -4.509265, -5.480327, -5.738597, -4.150312, -4.839559</min>
			<max>3.429435, 3.700269, 3.674218, 2.689023, 2.447877, 3.796455, 4.823751, 4.814300, 4.284663, 7.869397, 5.337945, 2.524132, 1.269280, 0.405836, 5.519212, 8.243701, 10.594466, 0.766087, 4.758397, 3.170860, 1.142504, 1.810520, 5.103805, 9.551643, 3.240988, 0.846419, 2.740798, 1.177772, 2.432126, 3.726336, 2.208188, 0.610985, 8.961679, 7.027319, 1.757295, 10.510656, 2.717644, 2.737868, 3.499144, 2.370403, 3.354144, 0.343958, 4.437463, 1.832197, 0.934699, 5.503766, 4.801977, 2.966651, 3.820568, 4.969003, 4.320631, 2.722138, 3.239754, 6.412441, 8.854413, 3.743961, 2.181079, 2.928961, 1.996874, 2.044940, 2.566653, 0.743482, 5.468718, 5.573136, 4.664586, 3.257355, 5.359721, 5.203478, 4.163172, 5.555080, 0.470708, 2.768162, 4.626716, 1.025795, 3.708481, 3.686304, 4.888070, 2.040133, 4.084060, 4.628593, 1.709242, 3.382280, 2.977187, 2.135484, 6.309508, 5.380356, 2.372864, 2.128798, 5.887513, 2.067376, 5.359750, 8.565346, 8.163108, 3.961072, 5.819194, 3.387053, 2.953495, 2.304596, 1.920968, 4.582163, 4.163924, -0.067669, 4.745985, 8.886450, 0.633174, 5.105834, 6.652740, 3.307892, 3.545277, 3.874053, 7.186567, 4.194041, 3.392613, 4.381091, 1.843383, 1.529642, 2.794033, 3.850415, 1.816620, -0.295237, 3.744004, 5.420012, 3.036198, 2.320942, 1.854587, 0.646627, 1.521050, 2.705915</max>
		</layer>
		<layer>
			<name>Convolution9_</name>
			<min>-0.141384, -0.140614, -0.122125, -0.132391, -0.161326, -0.217106, -0.144781, -0.139152, -0.067251, -0.131850, -0.105117, -0.200349, -0.165607, -0.158392, -0.129925, -0.117243, -0.170651, -0.139268, -0.142944, -0.268188, -0.170374, -0.185460, -0.194706, -0.125657, -0.179409, -0.139717, -0.137770, -0.144900, -0.161827, -0.116752, -0.095180, -0.131101, -0.164971, -0.164557, -0.132092, -0.117414, -0.110332, -0.125184, -0.171304, -0.132943, -0.172852, -0.173234, -0.170059, -0.245928, -0.168562, -0.154429, -0.177196, -0.087597, -0.099284, -0.146703, -0.118962, -0.167918, -0.128791, -0.199360, -0.124410, -0.209607, -0.192710, -0.120686, -0.163151, -0.140004, -0.183266, -0.182779, -0.147366, -0.201588, -0.130788, -0.118730, -0.102759, -0.157234, -0.121187, -0.167453, -0.272018, -0.188587, -0.183508, -0.184845, -0.111430, -0.171266, -0.169223, -0.131493, -0.119391, -0.151135, -0.219977, -0.142727, -0.106848, -0.155600, -0.109978, -0.128091, -0.106047, -0.170440, -0.136912, -0.217854, -0.130795, -0.147434, -0.171887, -0.146335, -0.119519, -0.138614, -0.088763, -0.160719, -0.210362, -0.113426, -0.106081, -0.172056, -0.155751, -0.087255, -0.181359, -0.100823, -0.163023, -0.187006, -0.168611, -0.104720, -0.199164, -0.176602, -0.142898, -0.176948, -0.114266, -0.156973, -0.155024, -0.143181, -0.104440, -0.162102, -0.097031, -0.237458, -0.225713, -0.202350, -0.108361, -0.170474, -0.172204, -0.213260</min>
			<max>0.192927, 0.163904, 0.216464, 0.141252, 0.175652, 0.116612, 0.129657, 0.141891, 0.227062, 0.127624, 0.233416, 0.108427, 0.125047, 0.152245, 0.169610, 0.223241, 0.125547, 0.213838, 0.153609, 0.185048, 0.154109, 0.105797, 0.191681, 0.193927, 0.116197, 0.130909, 0.183078, 0.127747, 0.135951, 0.205147, 0.181528, 0.134937, 0.116522, 0.113566, 0.183639, 0.150600, 0.191808, 0.199205, 0.125108, 0.164799, 0.145179, 0.117929, 0.143131, 0.135270, 0.149052, 0.153994, 0.142980, 0.168093, 0.161392, 0.200118, 0.155097, 0.179147, 0.129252, 0.208162, 0.170779, 0.107756, 0.142978, 0.184834, 0.131037, 0.178645, 0.126263, 0.121349, 0.161910, 0.096884, 0.162830, 0.141599, 0.238014, 0.192181, 0.195258, 0.164491, 0.123304, 0.115548, 0.223965, 0.127568, 0.140396, 0.179048, 0.207421, 0.131426, 0.173920, 0.162376, 0.127117, 0.132670, 0.163431, 0.172278, 0.176411, 0.141682, 0.178698, 0.120406, 0.144354, 0.117430, 0.127157, 0.147001, 0.102106, 0.123333, 0.153365, 0.261058, 0.178792, 0.127813, 0.124217, 0.137566, 0.148609, 0.154865, 0.119260, 0.183627, 0.112286, 0.174934, 0.139095, 0.183969, 0.101796, 0.192192, 0.219783, 0.114391, 0.167880, 0.204897, 0.146977, 0.113564, 0.103683, 0.159543, 0.221478, 0.129725, 0.210680, 0.127778, 0.124826, 0.187943, 0.224850, 0.109750, 0.178134, 0.108745</max>
		</layer>
		<layer>
			<name>Eltwise1</name>
			<min>-0.017028, -1.275471, -1.673704, -1.644008, -1.524418, -1.169149, -0.667587, -1.450444, -1.312477, -1.276353, -2.007165, -1.685464, -1.072019, -1.407206, -1.967463, -1.762276, -1.746051, -1.039968, -2.420270, -1.412734, -1.050735, -1.829014, -1.326287, -1.684462, -1.542513, -1.846280, -0.961611, -1.470429, -0.487193, -1.466300, -1.324069, -0.721018, -1.714208, -0.878640, -1.138389, -0.880113, -2.146951, -0.932845, -1.222792, -0.986625, -1.421620, -1.431515, -1.254966, -0.354831, -1.866524, -1.756024, -0.882827, -1.068052, -1.116835, -1.281034, -0.814001, -1.276935, -1.054696, -1.375416, -1.687976, -1.127508, -1.126485, -1.247669, -1.867485, -0.683524, -0.670696, -0.285824, -2.405033, -0.845408</min>
			<max>1.774242, 0.698047, 0.974963, 0.740626, 0.281967, 0.767644, 1.501642, 0.225284, 0.919347, 0.954617, 1.497935, 1.227051, 0.536636, 1.091346, 0.975359, 0.672788, 0.753025, 0.439833, 1.523668, 0.924011, 1.438146, 0.578670, 0.996933, 0.929003, 0.785881, 0.616365, 0.795084, 1.082354, 0.876318, 0.585555, 0.510384, 1.313209, 1.094867, 1.137769, 0.815225, 0.526590, 0.941590, 0.838114, 0.641267, 0.874459, 1.125475, 1.213152, 1.166444, 1.389872, 0.874906, 0.886343, 1.046168, 0.772610, 1.021919, 0.825788, 0.604562, 0.645271, 0.974916, 0.480049, 0.932897, 0.857911, 1.255972, 0.461210, 1.214344, 0.727669, 0.737296, 1.145959, 1.082185, 0.969820</max>
		</layer>
		<layer>
			<name>Eltwise2</name>
			<min>-0.443957, -0.605963, -0.640653, -0.484198, -0.516158, -0.565088, -0.526986, -0.397427, -0.578756, -0.467145, -0.534085, -0.445885, -0.434598, -0.392231, -0.662496, -0.528484, -0.610147, -0.478382, -0.324498, -0.443648, -0.546696, -0.445921, -0.387625, -0.338345, -0.671660, -0.594909, -0.489233, -0.595987, -0.441781, -0.408518, -0.501019, -0.367906, -0.477532, -0.397874, -0.378585, -0.303186, -0.526454, -0.471465, -0.453039, -0.516069, -0.667871, -0.414087, -0.481706, -0.676395, -0.488429, -0.601673, -0.474313, -0.442131, -0.481536, -0.402817, -0.637061, -0.417550, -0.424868, -0.487512, -0.420913, -0.439849, -0.482821, -0.550174, -0.539193, -0.491423, -0.404817, -0.518623, -0.449295, -0.466241, -0.667402, -0.452453, -0.492846, -0.416107, -0.469978, -0.381496, -0.476543, -0.424077, -0.446180, -0.544722, -0.544912, -0.688754, -0.503126, -0.500714, -0.461411, -0.447614, -0.461401, -0.426766, -0.328567, -0.516746, -0.546269, -0.484139, -0.437605, -0.544050, -0.493748, -0.490350, -0.447023, -0.457235, -0.538754, -0.614329, -0.654333, -0.462788, -0.362047, -0.467872, -0.447921, -0.465190, -0.542563, -0.598265, -0.359482, -0.490150, -0.503703, -0.651471, -0.508065, -0.464660, -0.540431, -0.454038, -0.532324, -0.382675, -0.460383, -0.461374, -0.558725, -0.224947, -0.584646, -0.306992, -0.325384, -0.421760, -0.452760, -0.344762, -0.501827, -0.670179, -0.449420, -0.461779, -0.699367, -0.407958</min>
			<max>0.216124, 0.216809, 0.257756, 0.130288, 0.168633, 0.562783, 0.243085, 0.380344, 0.187281, 0.407381, 0.255168, 0.466470, 0.171003, 0.219795, 0.189784, 0.336453, 0.249088, 0.563875, 0.351783, 0.301482, 0.303854, 0.330153, 0.251091, 0.312283, 0.100607, 0.231709, 0.337776, 0.117986, 0.317421, 0.300370, 0.238111, 0.212082, 0.339205, 0.196792, 0.474934, 0.261985, 0.366562, 0.236819, 0.264952, 0.295391, 0.115739, 0.274067, 0.140288, 0.273334, 0.231359, 0.351759, 0.198811, 0.476399, 0.175464, 0.295884, 0.250068, 0.341163, 0.308196, 0.234609, 0.283127, 0.320333, 0.301801, 0.168577, 0.198250, 0.144369, 0.353553, 0.199844, 0.281569, 0.270016, 0.299234, 0.274959, 0.244501, 0.239890, 0.204819, 0.166917, 0.257018, 0.243121, 0.222048, 0.215736, 0.209125, 0.128587, 0.229038, 0.198041, 0.225734, 0.164579, 0.206435, 0.275895, 0.464783, 0.240427, 0.249053, 0.240741, 0.288452, 0.350527, 0.257361, 0.307328, 0.281326, 0.236198, 0.245442, 0.088852, 0.280140, 0.243370, 0.349838, 0.215139, 0.261059, 0.316499, 0.253725, 0.274825, 0.230850, 0.193335, 0.332480, 0.070612, 0.203926, 0.247235, 0.333103, 0.266353, 0.169649, 0.234640, 0.159518, 0.369362, 0.187098, 0.398965, 0.291111, 0.404315, 0.484026, 0.423820, 0.288817, 0.418290, 0.304228, 0.297110, 0.423540, 0.295543, 0.137911, 0.267568</max>
		</layer>
		<layer>
			<name>Eltwise3</name>
			<min>-1.907564, -5.324944, -2.584927, -2.099427, -3.964873, -2.915219, -4.793260, -4.019541, -2.111626, -2.189340, -1.878041, -3.779873, -5.913455, -8.635453, -1.777671, -0.249340, -3.174783, -5.730870, -1.057399, -2.413578, -3.571058, -7.475122, -2.161009, -5.242243, -7.732908, -6.323933, -1.967382, -2.367035, -4.365279, -1.120882, -3.158793, -10.761180, -3.277239, -3.687467, -2.575033, -2.521878, -2.208740, -2.908697, -4.598978, -4.000963, -1.576979, -5.775121, -1.666942, -4.288087, -7.104886, -2.582561, -3.239947, -2.325077, -2.856584, -1.892248, -1.007207, -2.465359, -2.802383, -3.694602, -3.217989, -2.290163, -5.631609, -4.896439, -4.578271, -1.201638, -5.008301, -5.968531, -1.372641, -1.754668, -1.041370, -2.459767, -4.052456, -1.723538, -2.198922, -1.522968, -3.812165, -5.053628, -4.645249, -4.165840, -4.548175, -3.575165, -1.057271, -5.691209, -2.772001, -3.857198, -7.733587, -3.281178, -4.692113, -6.025166, -1.488777, -3.808657, -2.431131, -3.666995, -0.698720, -3.759022, -3.885885, -0.138630, -2.120354, -4.504014, -0.582519, -2.460079, -2.826749, -1.558318, -5.746382, -2.260880, -4.367985, -6.081302, -3.615337, 0.560889, -3.803660, -6.604887, -3.555866, -2.746310, -3.087168, -0.995096, -1.559035, -4.772481, -2.048341, -0.354973, -4.579305, -4.628964, -6.222413, -9.909677, -6.407003, -8.354704, -3.899036, -3.008315, -6.868675, -4.546631, -5.493344, -5.788953, -4.201906, -4.866153</min>
			<max>3.475531, 3.710648, 3.740433, 2.678443, 2.441540, 3.730961, 4.856013, 4.941118, 4.399026, 7.861291, 5.376379, 2.476548, 1.289025, 0.413592, 5.549860, 8.234210, 10.524568, 0.797860, 4.828226, 3.126103, 1.170680, 1.810385, 5.022070, 9.579741, 3.280487, 0.896627, 2.805602, 1.177811, 2.351528, 3.773983, 2.201317, 0.627348, 8.836780, 6.943242, 1.724609, 10.594956, 2.693786, 2.697961, 3.498795, 2.433382, 3.300122, 0.394773, 4.438357, 1.837798, 0.928520, 5.625850, 4.742742, 3.027977, 3.786014, 4.952445, 4.362332, 2.760020, 3.263377, 6.393613, 8.829145, 3.688315, 2.159716, 2.944713, 2.050731, 2.039855, 2.557002, 0.752501, 5.479669, 5.453331, 4.686422, 3.263134, 5.481597, 5.227953, 4.185263, 5.574124, 0.404131, 2.795418, 4.595315, 1.047041, 3.696763, 3.687738, 4.864021, 2.099275, 4.132128, 4.615304, 1.700763, 3.389483, 2.974463, 2.108804, 6.285203, 5.404897, 2.416899, 2.100536, 5.948894, 2.077207, 5.420952, 8.598346, 8.144469, 3.952628, 5.821994, 3.480676, 3.041466, 2.317952, 1.887334, 4.600194, 4.177206, -0.144220, 4.703924, 8.934053, 0.667851, 5.115231, 6.644749, 3.330505, 3.528387, 3.884891, 7.141387, 4.197771, 3.400951, 4.464654, 1.838341, 1.537781, 2.767060, 3.862851, 1.824424, -0.258206, 3.858929, 5.456958, 2.957689, 2.301570, 1.980565, 0.586679, 1.545702, 2.637382</max>
		</layer>
		<layer>
			<name>Mul_/Fused_Mul_/FusedScaleShift_</name>
			<min>-1.486210, -1.100639, -1.039412</min>
			<max>2.017180, 1.668351, 1.906080</max>
		</layer>
		<layer>
			<name>Mul_938/Fused_Mul_/FusedScaleShift_</name>
			<min>-1.000993, -0.966894, -1.147337, -0.816544, -0.961222, -1.249921, -0.841000, -0.966014, -1.106117, -0.883642, -1.391058, -0.533957, -0.678366, -0.974387, -1.177449, -1.253030, -1.118649, -1.179478, -0.797963, -1.072985, -1.216630, -0.805759, -0.765967, -1.233649, -1.009566, -0.690107, -1.004941, -0.885806, -0.538931, -0.597131, -0.899253, -0.576842, -0.843238, -0.838470, -0.895853, -0.257352, -0.883414, -1.097017, -0.751683, -0.786381, -1.048041, -0.911387, -0.770595, -1.288075, -1.123150, -1.181912, -0.716003, -0.405089, -0.757471, -0.696932, -0.757922, -1.044208, -1.038663, -0.596706, -0.576188, -0.731928, -0.737536, -0.558026, -1.257804, -0.795904, -0.996625, -0.785111, -0.885730, -0.829521, -0.931226, -1.091477, -1.015910, -0.878806, -0.760218, -0.896189, -0.909996, -0.774546, -0.975111, -1.144643, -0.995571, -1.014837, -0.848428, -1.131618, -0.920184, -0.867002, -0.952315, -1.044424, -0.686059, -0.748839, -0.785185, -0.739018, -0.675778, -1.048845, -0.578215, -0.899976, -0.931860, -0.874153, -1.020537, -0.991013, -0.879668, -0.574732, -0.536523, -0.899982, -0.962860, -0.913977, -1.127974, -0.959420, -0.726260, -0.852640, -1.298168, -1.277054, -0.589856, -0.713010, -0.985328, -0.631840, -0.948492, -0.956102, -0.642173, -0.889169, -0.752575, -0.562585, -1.032635, -0.689947, -1.080127, -0.777054, -0.913765, -0.744137, -1.028314, -1.142983, -0.710338, -1.003463, -1.150572, -0.792743</min>
			<max>0.483944, 0.406185, 0.632219, 0.414809, 0.486445, 0.861361, 0.400378, 0.618637, 0.524014, 0.543397, 0.591688, 0.452402, 0.358524, 0.386446, 0.498011, 0.655070, 0.505053, 1.321713, 0.481918, 0.606015, 0.738089, 0.520293, 0.459486, 0.638352, 0.331212, 0.530514, 0.680300, 0.367460, 0.418880, 0.393814, 0.505746, 0.289565, 0.614410, 0.385885, 0.705580, 0.280099, 0.628635, 0.574024, 0.512155, 0.603020, 0.461235, 0.553133, 0.254880, 0.685553, 0.487954, 0.621140, 0.442192, 0.517791, 0.399861, 0.392243, 0.453780, 0.681385, 0.698659, 0.474270, 0.446528, 0.462838, 0.409811, 0.446920, 0.424049, 0.397508, 0.591208, 0.379567, 0.560726, 0.509800, 0.432462, 0.664432, 0.629337, 0.546434, 0.283690, 0.469795, 0.596327, 0.384368, 0.392363, 0.552963, 0.416645, 0.472754, 0.443526, 0.389120, 0.523686, 0.417113, 0.541141, 0.571517, 0.605550, 0.355152, 0.402135, 0.538882, 0.356453, 0.550924, 0.423157, 0.510988, 0.593968, 0.409847, 0.523218, 0.426740, 0.463910, 0.284844, 0.414432, 0.340745, 0.493517, 0.551570, 0.480329, 0.555724, 0.364474, 0.466598, 0.948566, 0.378891, 0.391581, 0.499351, 0.514681, 0.399723, 0.380286, 0.523027, 0.396151, 0.664291, 0.339964, 0.352593, 0.678574, 0.456457, 0.970837, 0.543184, 0.510499, 0.707630, 0.411521, 0.729949, 0.545635, 0.840874, 0.400712, 0.372579</max>
		</layer>
		<layer>
			<name>Mul_941/Fused_Mul_/FusedScaleShift_</name>
			<min>-0.504788, -1.100831, -0.656862, -1.567505, -0.873975, -1.047771, -0.266430, -0.647008, -1.417575, -1.136612, -1.231986, -0.886641, -1.483869, -1.001915, -0.917917, -1.520697, -0.865010, -0.846773, -0.983751, -1.391221, -0.680382, -0.851530, -1.517818, -1.059633, -1.363468, -2.029816, -1.292212, -1.237723, -0.890540, -1.303790, -0.496715, -1.116190, -1.454922, -1.223954, -1.050618, -0.793075, -1.655688, -0.434717, -0.428279, -1.135996, -1.224839, -1.254589, -0.723436, -0.646005, -1.020061, -1.575614, -1.103309, -1.029912, -1.055838, -0.816475, -1.124512, -1.074899, -1.411968, -0.770837, -1.366073, -0.804070, -1.345881, -1.019030, -1.051710, -1.015250, -0.720437, -0.724421, -1.360435, -0.955714</min>
			<max>0.897479, 0.643705, 0.506541, 0.909026, 0.598676, 0.760437, 0.550016, 0.524786, 0.899500, 0.956593, 0.919019, 0.866192, 0.803402, 0.910110, 0.652711, 0.847069, 0.671315, 0.538715, 0.661554, 0.753926, 0.868698, 0.618573, 1.258414, 0.662642, 1.104118, 0.795911, 0.845381, 1.062159, 0.687212, 0.667873, 0.630433, 0.874851, 0.965359, 1.080826, 0.704604, 0.478592, 0.798701, 0.554845, 0.588955, 0.843883, 0.991465, 1.163610, 0.724929, 0.871114, 0.641436, 0.944970, 0.761778, 1.002170, 0.883072, 0.724287, 0.790562, 0.762222, 0.886732, 0.559242, 0.772461, 0.523369, 1.047992, 0.564693, 0.796835, 0.835792, 0.463608, 0.690179, 0.860580, 0.849676</max>
		</layer>
		<layer>
			<name>Pooling1</name>
			<min>-0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, 0.031911, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, 0.124424, -0.000000, -0.000000, 0.080710, -0.000000, -0.000000, 0.034276, -0.000000, -0.000000, -0.000000, -0.000000, 0.062388, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, 0.200579, -0.000000, -0.000000</min>
			<max>-0.000000, 0.497820, 0.832506, 0.346552, -0.000000, 0.203427, 0.714980, 0.501595, 0.467396, -0.000000, 1.200957, -0.000000, -0.000000, -0.000000, 0.898271, -0.000000, 0.766077, 0.533865, 0.872860, 0.826616, 0.752538, 1.163071, 0.659017, 0.915900, -0.000000, 0.508371, 0.465510, -0.000000, 0.415144, 0.486053, 0.630878, 0.672043, 0.693676, -0.000000, 0.765972, 0.267683, 0.656781, 0.560202, -0.000000, 0.572641, 0.644302, 0.777188, 0.545727, 0.547142, 0.516240, 1.077425, 0.504107, 0.453935, 0.264638, 0.502588, 0.426357, -0.000000, -0.000000, 0.738134, 0.467730, 0.445617, 0.793476, -0.000000, 0.659369, 0.358823, 0.305420, 0.878953, 0.503664, 0.529017</max>
		</layer>
		<layer>
